app/views/users/show.html.erb

SELECT "dares".* FROM "dares" WHERE "dares"."user_id" = 2
---
		      			<ul class="small-block-grid-4 small-centered">
		      				<%@user.dares.all.each do |dare| %>