app/controllers/bugs_controller.rb

  def create
  	@bug = Bug.new(params[:bug])
  	if @bug.save
---
INSERT INTO "bugs" ("bug", "created_at", "updated_at") VALUES (?, ?, ?)  [["bug", "I can't login!"], ["created_at", Thu, 01 Aug 2013 21:44:03 UTC +00:00], ["updated_at", Thu, 01 Aug 2013 21:44:03 UTC +00:00]]