app/controllers/dares_controller.rb

SELECT "dares".* FROM "dares" ORDER BY created_at DESC LIMIT 9 OFFSET 0
SELECT COUNT(*) FROM "dares"
---
  def index
  	@dares = Dare.order("created_at DESC").page(params[:page]).per(9)

SELECT "dares".* FROM "dares" WHERE "dares"."id" = ? LIMIT 1  [["id", "2"]]
SELECT "comments".* FROM "comments" WHERE "comments"."dare_id" = 2
---
  def show
  	@dare = Dare.find(params[:id])
    @comments = Dare.find(params[:id]).comments.all